import math
a=input('Введите ваш текст сюды(БЕРЕМ РУССКИЙ ЯЗЫК): ')
a=a.replace(' ',"")
print('(Вероятностный водход)Равновероятностный подход- Так как у нас русский язык , то это 32 буквы , тогда информационная емкость символа - 32<->2^5=>5',len(a)*5,'бит')
print('(Алфавитный подход)Система кодировки Unicod - 1 символ это 16 бит => колличество символов на 16=> ', len(a)*16,'бит')
print('(Вероятностный водход)НЕРавновероятностный подход')
massiveBYKAVI=['а','б','в','г','д','е','ё','ж','з','и','й','к',
               'л','м','н','о','п','р','с','т','у','ф','х','ц','ч'
    ,'ш','щ','ъ','ы','ь','э','ю','я']
MASSIVEveroyatnostey=[0.062,0.014,0.038,0.012,0.025,0.072,0.072,0.007,0.016,0.062,0.010,
                      0.028,0.035,0.026,0.053,0.090,0.023,0.040,0.045,0.053,0.021,
                      0.002,0.009,0.004,0.012,0.006,0.003,0.014,0.014,0.016,0.003,0.006,0.018]
massiveNyley=[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
massiveNyley2=[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
for i in a:
    for c in massiveBYKAVI:
        if i==c:
            massiveNyley[massiveBYKAVI.index(c)]+=1
ver2=0
b=len(massiveNyley)
q=0
while q<b:
    if massiveNyley[q]!=0:
        ver2+=massiveNyley[q]*math.log2(MASSIVEveroyatnostey[q])*MASSIVEveroyatnostey[q]
        q+=1
    else:
        q+=1
print((-1*ver2)*len(a))#---------------------------------------------------------------------------осталься невероятностный метод , в котором мы рассчитываем вес букав
ma1=0
ver1=0
while ma1<b:
    if massiveNyley[ma1]!=0:
        ver1=math.log2(massiveNyley[ma1]/len(a))
        massiveNyley2[ma1]=ver1
        ver1=0
        ma1+=1
    else:
        ma1+=1
ma2=0
ver2=0
while ma2<b:
    if massiveNyley[ma2]!=0:
        ver2+=massiveNyley[ma2]/len(a)*massiveNyley2[ma2]
        ma2+=1
    else:
        ma2+=1
print((-1*ver2))